In [1]:
import pandas as pd

## 예제 8-1  수학함수 알아보기

In [2]:
import numpy as np

In [3]:
rng = np.random.RandomState(42)

In [4]:
ser = pd.Series(rng.randint(0, 10, 4))

In [5]:
ser1 = pd.Series(rng.randint(0, 10, 4))

In [6]:
ser

0    6
1    3
2    7
3    4
dtype: int32

In [7]:
ser1

0    6
1    9
2    2
3    6
dtype: int32

In [8]:
ser + ser

0    12
1     6
2    14
3     8
dtype: int32

In [9]:
ser.__add__(ser)

0    12
1     6
2    14
3     8
dtype: int32

In [10]:
ser.add(ser)

0    12
1     6
2    14
3     8
dtype: int32

In [11]:
ser.radd(ser1)

0    12
1    12
2     9
3    10
dtype: int32

In [12]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [13]:
np.log(np.exp(ser))

0    6.0
1    3.0
2    7.0
3    4.0
dtype: float64

In [14]:
np.matmul(ser,ser)

110

In [15]:
ser.values @ ser.values

110

In [16]:
np.__dict__['matmul']

In [17]:
ser.dot(ser)

110

## 예제 8-2  데이터프레임 브로드캐스팅 이해하기

In [18]:
df_2 = pd.DataFrame((rng.randint(0, 20, (4, 4))), columns=list('QRST'))

In [19]:
df_2

    Q   R   S   T
0  10  10   3   7
1   2   1  11   5
2   1   0  11  11
3  16   9  15  14

In [20]:
type(df_2.iloc[0])

pandas.core.series.Series

In [21]:
df_2 - df_2.iloc[0]

   Q   R   S  T
0  0   0   0  0
1 -8  -9   8 -2
2 -9 -10   8  4
3  6  -1  12  7

In [52]:
df_2.iloc[0]

Q    10
R    10
S     3
T     7
Name: 0, dtype: int32

In [22]:
df_3 = pd.DataFrame([df_2.iloc[0]])

In [23]:
df_3

    Q   R  S  T
0  10  10  3  7

In [24]:
df_3_s = pd.DataFrame()

In [25]:
for _ in range(4) :
    print("loop")
    df_3_s = df_3_s.append(df_3, ignore_index=True)

loop
loop
loop
loop

In [26]:
df_3_s

    Q   R  S  T
0  10  10  3  7
1  10  10  3  7
2  10  10  3  7
3  10  10  3  7

In [27]:
df_2 - df_3_s

   Q   R   S  T
0  0   0   0  0
1 -8  -9   8 -2
2 -9 -10   8  4
3  6  -1  12  7

In [28]:
df_2 - df_2.iloc[0]

   Q   R   S  T
0  0   0   0  0
1 -8  -9   8 -2
2 -9 -10   8  4
3  6  -1  12  7

In [29]:
df_2.subtract(df_2.iloc[0],axis=1)

   Q   R   S  T
0  0   0   0  0
1 -8  -9   8 -2
2 -9 -10   8  4
3  6  -1  12  7

In [30]:
df_2.subtract(df_2.iloc[0],axis=0)

    Q   R   S   T
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
3 NaN NaN NaN NaN
Q NaN NaN NaN NaN
R NaN NaN NaN NaN
S NaN NaN NaN NaN
T NaN NaN NaN NaN

In [53]:
df_2['R']

0    10
1     1
2     0
3     9
Name: R, dtype: int32

In [57]:
df_2 - df_2['R']

    Q   R   S   T   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [55]:
df_2.subtract(df_2['R'],axis=0)

   Q  R   S   T
0  0  0  -7  -3
1  1  0  10   4
2  1  0  11  11
3  7  0   6   5

In [56]:
df_2.subtract(df_2['R'],axis=1)

    Q   R   S   T   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

## 예제 8-3   rolling expanding 수학함수 알아보기

In [31]:
import numpy as np

In [32]:
rng = np.random.RandomState(42)

In [33]:
df_re = pd.DataFrame(np.random.randn(10, 4),
                 index = pd.date_range('1/1/2000', periods=10),
                 columns = ['A', 'B', 'C', 'D'])

In [34]:
df_re.expanding()

Expanding [min_periods=1,center=False,axis=0]

In [35]:
type(df_re.expanding())

pandas.core.window.Expanding

In [36]:
count = 0
for i in dir(df_re.expanding()):
    if not i.startswith("_") :
        print(i, end=',  ')
        count += 1
        if count % 5 == 0 :
            print()

A,  B,  C,  D,  agg,
aggregate,  apply,  corr,  count,  cov,
exclusions,  is_datetimelike,  is_freq_type,  kurt,  max,
mean,  median,  min,  ndim,  quantile,
skew,  std,  sum,  validate,  var,

In [37]:
type(df_re.rolling(window=1))

pandas.core.window.Rolling

In [38]:
count = 0
for i in dir(df_re.rolling(window=1)):
    if not i.startswith("_") :
        print(i, end=',  ')
        count += 1
        if count % 5 == 0 :
            print()

A,  B,  C,  D,  agg,
aggregate,  apply,  corr,  count,  cov,
exclusions,  is_datetimelike,  is_freq_type,  kurt,  max,
mean,  median,  min,  ndim,  quantile,
skew,  std,  sum,  validate,  var,

In [39]:
df_re.sum()

A   -3.741979
B   -1.557788
C    2.765169
D    0.626924
dtype: float64

In [40]:
df_re.cumsum()

                   A         B         C         D
2000-01-01 -0.451041 -2.516195  1.347456 -1.940037
2000-01-02 -1.027927 -2.546473  1.114106 -0.514140
2000-01-03  0.556168 -2.994569  1.793651 -0.955122
2000-01-04 -0.576010 -2.937324  1.687871  0.746848
2000-01-05 -1.476968 -2.783027  0.928172 -1.210385
2000-01-06 -1.337788 -3.707287  2.324373 -0.494092
2000-01-07 -2.071957 -1.930908  3.061432  1.627639
2000-01-08 -3.839811 -2.441614  2.880210  2.843267
2000-01-09 -4.018486 -2.011127  1.450010  1.572275
2000-01-10 -3.741979 -1.557788  2.765169  0.626924

In [41]:
df_re.expanding( min_periods=1).sum()

                   A         B         C         D
2000-01-01 -0.451041 -2.516195  1.347456 -1.940037
2000-01-02 -1.027927 -2.546473  1.114106 -0.514140
2000-01-03  0.556168 -2.994569  1.793651 -0.955122
2000-01-04 -0.576010 -2.937324  1.687871  0.746848
2000-01-05 -1.476968 -2.783027  0.928172 -1.210385
2000-01-06 -1.337788 -3.707287  2.324373 -0.494092
2000-01-07 -2.071957 -1.930908  3.061432  1.627639
2000-01-08 -3.839811 -2.441614  2.880210  2.843267
2000-01-09 -4.018486 -2.011127  1.450010  1.572275
2000-01-10 -3.741979 -1.557788  2.765169  0.626924

In [42]:
type(df_re.expanding( min_periods=1).sum())

pandas.core.frame.DataFrame

In [43]:
df_re.rolling(window=len(df_re), min_periods=1).sum()

                   A         B         C         D
2000-01-01 -0.451041 -2.516195  1.347456 -1.940037
2000-01-02 -1.027927 -2.546473  1.114106 -0.514140
2000-01-03  0.556168 -2.994569  1.793651 -0.955122
2000-01-04 -0.576010 -2.937324  1.687871  0.746848
2000-01-05 -1.476968 -2.783027  0.928172 -1.210385
2000-01-06 -1.337788 -3.707287  2.324373 -0.494092
2000-01-07 -2.071957 -1.930908  3.061432  1.627639
2000-01-08 -3.839811 -2.441614  2.880210  2.843267
2000-01-09 -4.018486 -2.011127  1.450010  1.572275
2000-01-10 -3.741979 -1.557788  2.765169  0.626924

In [44]:
df_re.max()

A    1.584095
B    1.776380
C    1.396201
D    2.121731
dtype: float64

In [45]:
df_re.cummax()

                   A         B         C         D
2000-01-01 -0.451041 -2.516195  1.347456 -1.940037
2000-01-02 -0.451041 -0.030278  1.347456  1.425896
2000-01-03  1.584095 -0.030278  1.347456  1.425896
2000-01-04  1.584095  0.057245  1.347456  1.701971
2000-01-05  1.584095  0.154297  1.347456  1.701971
2000-01-06  1.584095  0.154297  1.396201  1.701971
2000-01-07  1.584095  1.776380  1.396201  2.121731
2000-01-08  1.584095  1.776380  1.396201  2.121731
2000-01-09  1.584095  1.776380  1.396201  2.121731
2000-01-10  1.584095  1.776380  1.396201  2.121731

In [46]:
df_re.expanding().max()

                   A         B         C         D
2000-01-01 -0.451041 -2.516195  1.347456 -1.940037
2000-01-02 -0.451041 -0.030278  1.347456  1.425896
2000-01-03  1.584095 -0.030278  1.347456  1.425896
2000-01-04  1.584095  0.057245  1.347456  1.701971
2000-01-05  1.584095  0.154297  1.347456  1.701971
2000-01-06  1.584095  0.154297  1.396201  1.701971
2000-01-07  1.584095  1.776380  1.396201  2.121731
2000-01-08  1.584095  1.776380  1.396201  2.121731
2000-01-09  1.584095  1.776380  1.396201  2.121731
2000-01-10  1.584095  1.776380  1.396201  2.121731

In [47]:
df_re.rolling(window=len(df_re),min_periods=1).max()

                   A         B         C         D
2000-01-01 -0.451041 -2.516195  1.347456 -1.940037
2000-01-02 -0.451041 -0.030278  1.347456  1.425896
2000-01-03  1.584095 -0.030278  1.347456  1.425896
2000-01-04  1.584095  0.057245  1.347456  1.701971
2000-01-05  1.584095  0.154297  1.347456  1.701971
2000-01-06  1.584095  0.154297  1.396201  1.701971
2000-01-07  1.584095  1.776380  1.396201  2.121731
2000-01-08  1.584095  1.776380  1.396201  2.121731
2000-01-09  1.584095  1.776380  1.396201  2.121731
2000-01-10  1.584095  1.776380  1.396201  2.121731

In [48]:
df_diff = pd.DataFrame({'B': [0, 1, 2, np.nan, 4]})

In [49]:
df_diff.cumsum()

     B
0  0.0
1  1.0
2  3.0
3  NaN
4  7.0

In [50]:
df_diff.fillna(0).cumsum()

     B
0  0.0
1  1.0
2  3.0
3  3.0
4  7.0

In [51]:
df_diff.expanding(min_periods=1).sum()

     B
0  0.0
1  1.0
2  3.0
3  3.0
4  7.0